[{"About": "Science, philosophy, society and the arts", "Bias": "left-center", "Credibility": "high credibility", "Factual": "high", "Name": "Aeon", "Profile": "https://mediabiasfactcheck.com/aeon/", "Topics": "Philosophy, Science, Psychology, Society, Culture", "TrustFactors": "Not-for-profit, registered UK charity operated by Aeon Media Group Ltd. Deductible Gift Recipient (DGR) organization in Australia. Through Aeon America, US 501(c)(3) nonprofit organization. Funded by donations and sponsorships in email newsletters.", "Website": "https://aeon.co/", "Wikipedia": "https://en.wikipedia.org/wiki/Aeon_(digital_magazine)", "X": "https://twitter.com/aeonmag", "Youtube": "n/a"}, {"About": "Unlike regular news services, AllSides exposes bias and provides multiple angles on the same story so you can quickly get the full picture, not just one slant.", "Bias": null, "Credibility": null, "Factual": null, "Name": "AllSides", "Profile": null, "Topics": "Abortion, Arts and Entertainment, Australia, Banking and Finance, Business, Campaign Finance, China, Civil Rights, Common Ground, Coronavirus, Criminal Justice, Culture, Defense and Security, Economy and Jobs, Education, Elections, Energy, Environment, Facts and Fact Checking, Fake News, Family and Marriage, Federal State and Tribal Powers, Foreign Policy, Free Speech, General News, Gun Control and Gun Rights, Healthcare, Housing and Homelessness, Humor and Satire, Immigration, Inequality, Justice, LGBTQ Issues, Media Bias, Media Industry, Middle East, Polarization, Politics, Presidential Election, Privacy, Public Health, Race and Racism, Religion and Faith, Russia, Russia-Ukraine Conflict, Science, Sexual Misconduct, Sports, Supreme Court, Sustainability, Taxes, Technology, Terrorism, The Americas, Threats to Democracy, Trade, US Census, US Constitution, Ukraine War, Violence in America, Voting Rights, Voter Fraud", "TrustFactors": "AllSides staff self-report their political leanings. As of 2021, AllSides made money through paid memberships, one-time donations, media literacy training and online advertisements​​.", "Website": "https://www.allsides.com/", "Wikipedia": "https://en.wikipedia.org/wiki/AllSides", "X": "https://twitter.com/AllSidesNow", "Youtube": "https://www.youtube.com/@AllSidesNow"}, {"About": "Qatar-based international news organization. It operates a website, aljazeera.com, which offers news coverage with a focus on the Middle East and global affairs. Known for its diverse viewpoints, especially from the Middle East, it covers a range of topics including politics, economics, culture, and social issues. Al Jazeera is recognized for its in-depth reporting and has gained a reputation for providing perspectives often not seen in Western media outlets.", "Bias": "left-center", "Credibility": "medium credibility", "Factual": "mixed", "Name": "Al Jazeera", "Profile": "https://mediabiasfactcheck.com/al-jazeera/", "Topics": "Politics, Middle East, International Relations, Economics, Social Issues, Culture, Environment, Science, Health, Human Rights, Conflicts, Diplomacy, Sports, Technology, Media Analysis, Israel Palestine conflict", "TrustFactors": "Funded by the government of Qatar", "Website": "https://www.aljazeera.com", "Wikipedia": "https://en.wikipedia.org/wiki/Al_Jazeera", "X": "https://twitter.com/AJEnglish", "Youtube": "https://www.youtube.com/@aljazeeraenglish"}, {"About": "Award-winning news magazine and online community that creates original journalism and amplifies the best of hundreds of other independent media sources", "Bias": "left", "Credibility": "medium credibility", "Factual": "mixed", "Name": "Alternet", "Profile": "https://mediabiasfactcheck.com/alternet/", "Topics": "Progressive news and culture, including News & Politics, World, Economy, Civil Liberties, Immigration, Reproductive Justice, Environment, Animal Rights, Food, Water, Books, Media and Culture, Belief, Drugs, Personal Health, Sex and Relationships, Vision, and Investigations.", "TrustFactors": "Until April 2018, financed through individual donations, grants from major donors, and ad revenue​​.", "Website": "https://www.alternet.org", "Wikipedia": "https://en.wikipedia.org/wiki/AlterNet", "X": "https://twitter.com/AlterNet", "Youtube": "n/a"}, {"About": "Human rights", "Bias": "left-center", "Credibility": "high credibility", "Factual": "high", "Name": "Amnesty International", "Profile": "https://mediabiasfactcheck.com/amnesty-international/", "Topics": "Human Rights Advocacy, International Law, Social Justice, Civil Liberties, Humanitarian Aid", "TrustFactors": "UK registered charity. Funded by donations. No government or political party donations.", "Website": "https://www.amnesty.org", "Wikipedia": "https://en.wikipedia.org/wiki/Amnesty_International", "X": "https://twitter.com/amnesty", "Youtube": "https://www.youtube.com/@amnesty"}, {"About": "Anthropocene Magazine focuses on creating a sustainable human age, highlighting solutions rather than just environmental crises. They offer evidence-based journalism to spark discussions about innovation and reform in climate and sustainability science.", "Bias": "left-center", "Credibility": "high credibility", "Factual": "high", "Name": "Anthropocene Magazine", "Profile": "https://mediabiasfactcheck.com/conservation-magazine/", "Topics": "Anthropocene, Biodiversity, Cities, Decarbonization, Environment, Food & Agriculture, Climate Change, Sustainable Consumption, Oceans, Health, Green Business.", "TrustFactors": "Nonprofit. Owned by Future Earth. Funded by donations, grants, and sponsorships, and by the U.S. US Science Foundation, which is funded by the U.S. government.", "Website": "https://anthropocenemagazine.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Anthropocene_(journal)", "X": "https://twitter.com/AnthropoceneMag", "Youtube": "n/a"}, {"About": "UK and global news", "Bias": "left-center", "Credibility": "high credibility", "Factual": "high", "Name": "BBC", "Profile": "https://mediabiasfactcheck.com/bbc/", "Topics": "News, Sport, Music, Science, Technology, Entertainment, Comedy, Food, Health, History, Learning, Music, Science and Nature.", "TrustFactors": "Funded primarily by the UK television license fee.", "Website": "http://www.bbc.com/news", "Wikipedia": "https://en.wikipedia.org/wiki/BBC_News", "X": "https://twitter.com/BBCNews", "Youtube": "https://www.youtube.com/@BBCNews"}, {"About": "News, commentary, and analysis from the Black left", "Bias": "left", "Credibility": "medium credibility", "Factual": "mixed", "Name": "Black Agenda Report", "Profile": "https://mediabiasfactcheck.com/black-agenda-report/", "Topics": "Africa, African America, Education, Environment, International affairs, Media and Culture, Political Economy, U.S. Politics, War, Empire", "TrustFactors": "Operated by Black journalists and activists. Audience supported.", "Website": "https://www.blackagendareport.com/", "Wikipedia": "n/a", "X": "https://twitter.com/blkagendareport", "Youtube": "n/a"}, {"About": "News and commentary from African-American-owned newspapers and media companies", "Bias": "left-center", "Credibility": "high credibility", "Factual": "high", "Name": "BlackPressUSA", "Profile": "https://mediabiasfactcheck.com/black-press-usa-bias/", "Topics": "U.S. and International News, Politics, Business, Arts and Entertainment, Sports, Lifestyle, Education, Technology, History", "TrustFactors": "Published by the US Newspaper Publishers Association (NNPA), the trade organization advocating for America’s African-American-owned newspapers and media companies. Features content by member publications and by NNPA News Service. Funded in part by corporate sponsorships.", "Website": "https://blackpressusa.com/", "Wikipedia": "https://en.wikipedia.org/wiki/National_Newspaper_Publishers_Association", "X": "https://twitter.com/BlackPressUSA", "Youtube": "https://www.youtube.com/@BlackPressUSATV"}, {"About": "Immigration news", "Bias": null, "Credibility": null, "Factual": null, "Name": "Borderless Magazine", "Profile": null, "Topics": "Black Immigrants Today, After the Bus series, Afghans in Exile series, Environment, As Told To, Investigation, Arts & Culture, Immigration Policy, Resources", "TrustFactors": "501(c)(3) nonprofit organization. Funded by grants and donations. Partners with other media organizations. Viewpoint: immigration journalism for a more just and equitable future.", "Website": "https://borderlessmag.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Borderless_(magazine)", "X": "https://twitter.com/BorderlessMag", "Youtube": "https://www.youtube.com/@BorderlessMagazine"}, {"About": "BreakThrough News is a media outlet that focuses on providing alternative and independent news coverage, analysis, and commentary on various social, political, and economic issues. It aims to offer perspectives that may not be as prominently featured in mainstream media. BreakThrough News covers topics such as social justice, activism, inequality, international affairs, and more, with a particular emphasis on grassroots movements and marginalized communities. It seeks to challenge the status quo and provide a platform for voices that are often underrepresented in traditional media.", "Bias": "left", "Credibility": "medium credibility", "Factual": "mixed", "Name": "BreakThrough News", "Profile": "https://mediabiasfactcheck.com/breakthrough-news-bias/", "Topics": "Israel Palestine conflict, Africa, Asia, Black America, Economy, Latin America, Middle East, U.S. Foreign Policy, Women's Rights, Climate, Labor, China, People's Movements, Palestine, News, Shows, Documentaries, Social Issues, Political Issues, Resistance Movements, Mainstream Media Critique.", "TrustFactors": "501(c)3 nonprofit organization in the United States. No corporate donations or state funding. Our funding derives from our viewers, supporters, and foundations that share our mission.", "Website": "https://breakthroughnews.org", "Wikipedia": "https://en.wikipedia.org/wiki/BreakThrough_News", "X": "https://twitter.com/btnewsroomhttps://twitter.com/btnewsroom", "Youtube": "https://www.youtube.com/@BreakThroughNews"}, {"About": "American Indian news", "Bias": null, "Credibility": null, "Factual": null, "Name": "Buffalo's Fire", "Profile": null, "Topics": "Indigenous democracy, Environmental reporting, Cultural preservation", "TrustFactors": "Published by the Indigenous Media Freedom Alliance, a 501(c)(3) nonprofit organization, located on the Fort Berthold Reservation in North Dakota. Edited by Jodi Rave Spotted Bear, who is Mandan-Hidatsa and Lakota. Reader supported.", "Website": "https://www.buffalosfire.com/", "Wikipedia": "n/a", "X": "https://twitter.com/buffalosfire", "Youtube": "https://www.youtube.com/@buffalosfiretv4193"}, {"About": "Nuclear risk, climate change, and disruptive technologies", "Bias": "left-center", "Credibility": "high credibility", "Factual": "high", "Name": "Bulletin of the Atomic Scientists", "Profile": "https://mediabiasfactcheck.com/bulletin-of-the-atomic-scientists/", "Topics": "Nuclear risk, Climate change, Disruptive technologies", "TrustFactors": "501(c)(3) nonprofit organization. Funded by grants and by individual and corporate donations. Viewpoint: opposed to extinction.", "Website": "https://thebulletin.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Bulletin_of_the_Atomic_Scientists", "X": "https://twitter.com/BulletinAtomic", "Youtube": "https://www.youtube.com/@BulletinAtomic"}, {"About": "The C-SPAN networks were created by the cable industry and are offered as a public service to provide access to balanced, commercial-free coverage of the American political process.", "Bias": "center", "Credibility": "high credibility", "Factual": "very high", "Name": "C-Span", "Profile": "https://mediabiasfactcheck.com/c-span/", "Topics": "United States federal government proceedings, U.S. House of Representatives, U.S. Senate, Government hearings, Political events, Historical programming, Non-fiction books, Public policy, U.S. Political campaigns, Republican and Democratic presidential nominating conventions, Libertarian party events, Midterm elections, Congressional hearings, White House press briefings, Presidential speeches, Federal Communications Commission hearings, Pentagon press conferences, State of the Union speeches, Presidential press conferences, Press conferences, National Press Club events, Public policy seminars, White House Correspondents' Dinner, Supreme Court audio recordings, International government proceedings (e.g., Parliament of Australia, Parliament of Canada, Parliament of the United Kingdom), Global news events, Lying in state ceremonies, State funerals, Natural disaster coverage, Space Shuttle mission launches", "TrustFactors": "The networks are privately funded by the cable industry, without government or taxpayer support.", "Website": "https://www.c-span.org/", "Wikipedia": "https://en.wikipedia.org/wiki/C-SPAN", "X": "https://twitter.com/cspan", "Youtube": "https://www.youtube.com/@CSPAN"}, {"About": "Education", "Bias": "left-center", "Credibility": "high credibility", "Factual": "high", "Name": "Chalkbeat", "Profile": "https://mediabiasfactcheck.com/chalkbeat-bias/", "Topics": "Education policy, Teacher effectiveness, COVID-19 impact", "TrustFactors": "Nonprofit. Funded by donations and grants.", "Website": "https://www.chalkbeat.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Chalkbeat", "X": "https://twitter.com/Chalkbeat", "Youtube": "https://www.youtube.com/@Chalkbeat"}, {"About": "US and world news", "Bias": "left", "Credibility": "high credibility", "Factual": "high", "Name": "Common Dreams", "Profile": "https://mediabiasfactcheck.com/common-dreams/", "Topics": "Social justice, Climate, Politics", "TrustFactors": "501(c)(3) nonprofit. Reader supported, small donations. No ads, no corporate or government funds. Social justice viewpoint.", "Website": "https://www.commondreams.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Common_Dreams", "X": "https://twitter.com/commondreams", "Youtube": "https://www.youtube.com/@commondreams8256"}, {"About": "Since 1995, as the first investigative news magazine based on the Internet, Consortiumnews.com has managed to produce groundbreaking journalism on many of the most significant issues of the day, including national security, foreign policy, politics and the environment. ", "Bias": "left", "Credibility": "high credibility", "Factual": "mostly", "Name": "Consortium News", "Profile": "https://mediabiasfactcheck.com/consortium-news/", "Topics": "Advanced technologies, American empire, Politics, Human rights, Climate change, Foreign policy, Historical analysis, Military and militarism, Media analysis, Legal issues, Political commentary, Global news", "TrustFactors": "Pioneer in investigative journalism on the internet, has established credibility through its long-standing presence since 1995. They are known for their detailed reporting on complex issues like advanced technologies, American empire, and political corruption. Their commitment to in-depth investigative journalism and focus on historically significant political and social issues contribute to their trustworthiness. ", "Website": "https://consortiumnews.com/", "Wikipedia": "https://en.wikipedia.org/wiki/Consortiumnews.com", "X": "https://twitter.com/Consortiumnews", "Youtube": "https://www.youtube.com/@consortiumnews8744"}, {"About": "Humanity faces threats like climate change, resource depletion, rising food and fuel prices, hunger, natural calamities, water scarcity, debt crisis, unemployment, social tensions, human rights violations, and ecological degradation. Countercurrents.org aims to raise awareness about these crises and find solutions, advocating for the end of energy-intensive globalization, replacing it with low energy, sustainable local economies, and an equitable distribution of resources. They focus on issues like Climate Change, Peak oil, Palestine, Iraq, Syria, and question capitalism and consumerism, promoting a sustainable ecological economy and wealth distribution.", "Bias": null, "Credibility": null, "Factual": null, "Name": "Counter Currents", "Profile": null, "Topics": "Progressive News, Human Rights, Environmentalism, Climate Change, Social Justice, India News, Global South", "TrustFactors": "Owned and edited by Binu Mathew. It is a news and opinion website based in India, founded in 2001. The site is known for its progressive left perspective and is non-commercial. It is mostly factual in its reporting, with a high credibility rating, despite being one-sided in its editorial positions", "Website": "https://countercurrents.org", "Wikipedia": "https://en.wikipedia.org/wiki/Countercurrents.org", "X": "https://twitter.com/Countercurrents", "Youtube": "https://www.youtube.com/user/CCMEDIACHANNEL"}, {"About": "Independent left-leaning articles on various topics, including special segments and weekend editions, with a history of publishing books and a newsletter/magazine.", "Bias": "left", "Credibility": "high credibility", "Factual": "mostly", "Name": "CounterPunch", "Profile": "https://mediabiasfactcheck.com/counterpunch/", "Topics": "Politics, Left-wing politics, Muckraking, US politics, Social issues, Environmental issues, Economic issues, International politics, Civil liberties, Radical viewpoints", "TrustFactors": "Owned by The Institute for the Advancement of Journalistic Clarity. It generates revenue through book sales, donations, grants, and advertising.", "Website": "https://www.counterpunch.org", "Wikipedia": "https://en.wikipedia.org/wiki/CounterPunch", "X": "https://twitter.com/CounterPunch_", "Youtube": "n/a"}, {"About": "Rural America", "Bias": null, "Credibility": null, "Factual": null, "Name": "Daily Yonder", "Profile": null, "Topics": "Rural communities, agriculture, rural economy, rural healthcare and education", "TrustFactors": "Nonprofit. Funded by donations, grants, and sponsorships.", "Website": "https://dailyyonder.com/", "Wikipedia": "https://en.wikipedia.org/wiki/Daily_Yonder", "X": "https://twitter.com/dailyyonder", "Youtube": "https://www.youtube.com/@DailyYonder"}, {"About": "Democracy in Europe Movement 2025 (DiEM25) is a pan-European political movement and political party founded in 2016 by a group of Europeans, including Yanis Varoufakis and Srećko Horvat. DiEM25 aims to democratize the European Union (EU) and address issues related to transparency, technology, economy, environment, refugees and migrants, culture, post-capitalism, and the European constitutional process. It advocates for a more democratic and transparent EU, and it has gained support from individuals across Europe who share these goals.", "Bias": null, "Credibility": null, "Factual": null, "Name": "Democracy in Europe Movement 2025", "Profile": null, "Topics": "Israel Palestine conflict, EU politics, pan-Europeanism, post-capitalism, progressivism, democratic socialism, environmentalism, ecofeminism, alter-globalisation​, oligarchies", "TrustFactors": "501(c)(3) nonprofit", "Website": "https://diem25.org", "Wikipedia": "https://en.wikipedia.org/wiki/Democracy_in_Europe_Movement_2025", "X": "https://twitter.com/diem_25", "Youtube": "https://www.youtube.com/@DiEM25official"}, {"About": "Daily, global, independent news hour with breaking headlines and in-depth interviews on pressing issues, offering diverse and provocative perspectives.", "Bias": "left", "Credibility": "high credibility", "Factual": "high", "Name": "Democracy Now", "Profile": "https://mediabiasfactcheck.com/democracy-now/", "Topics": "COP28 Climate Summit, Israel Palestine conflict, Climate crisis, Immigration, Ukraine conflict, Abortion rights, Donald Trump, Gun control, Police brutality, Supreme Court issues", "TrustFactors": "501(c)(3) nonprofit. Audience supported. No ads, underwriting, corporate or government funding.", "Website": "https://www.democracynow.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Democracy_Now!", "X": "https://twitter.com/democracynow", "Youtube": "https://www.youtube.com/@DemocracyNow"}, {"About": "", "Bias": "left", "Credibility": "no credibility rating available", "Factual": "mostly", "Name": "Electronic Intifada", "Profile": "https://mediabiasfactcheck.com/electronic-intifada/", "Topics": "", "TrustFactors": "", "Website": "https://electronicintifada.org/", "Wikipedia": "", "X": "", "Youtube": "https://www.youtube.com/@TheElectronicIntifada"}, {"About": "Environmental solutions", "Bias": null, "Credibility": null, "Factual": null, "Name": "Ensia", "Profile": null, "Topics": "Climate Change, Biodiversity, Water Issues, Sustainable Energy, Food Systems, Conservation, Environmental Policy, Sustainable Technology, Ecosystems", "TrustFactors": "Nonprofit. Funded by donations and grants.", "Website": "https://ensia.com/", "Wikipedia": "n/a", "X": "https://twitter.com/ensiamedia", "Youtube": "https://www.youtube.com/@ensia9074"}, {"About": "Advocating good science and journalism in environmental health, focusing on climate change, equity in health, and sustainability, with daily articles and news digests on various environmental health topics.", "Bias": null, "Credibility": null, "Factual": null, "Name": "Environmental Health News", "Profile": null, "Topics": "Air Pollution, Climate Change, Environmental Disasters, Public Health, Toxicology, Endocrine Disruptors, Water Quality, Environmental Policies, Pollution, Environmental Conservation", "TrustFactors": "nonprofit, nonpartisan", "Website": "https://www.ehn.org", "Wikipedia": "https://en.wikipedia.org/wiki/Environmental_Health_News", "X": "https://twitter.com/EnvirHealthNews", "Youtube": "https://www.youtube.com/@EnvironmentalHealthNewsEHN"}, {"About": "Fair Observer is a section 501(c)(3) nonprofit media organization in the US that educates global citizens both through its journal and its teaching programs. Our crowdsourced multimedia journal, with strong editorial processes, provides a 360° view to help you make sense of the world. Our education and training programs for students, young professionals and business executives cover subjects like journalism, geopolitics, the global economy, diversity and more.", "Bias": "left-center", "Credibility": "high credibility", "Factual": "high", "Name": "Fair Observer", "Profile": "https://mediabiasfactcheck.com/fair-observer/", "Topics": "Politics, Economics & Finance, Business & Entrepreneurship, Art & Culture, Science & Technology, Environment & Climate Change, World Leaders, The Americas, Europe, Middle East & North Africa, Africa, Asia, United States, India, China, Russia", "TrustFactors": "501(c)(3) nonprofit. Reader supported. No ads.", "Website": "https://www.fairobserver.com/", "Wikipedia": "https://en.wikipedia.org/wiki/Fair_Observer", "X": "https://twitter.com/FairObserver", "Youtube": "https://www.youtube.com/@FairObserver"}, {"About": "Progressive media watchdog challenging corporate media bias and misinformation, advocating for press diversity, exposing neglected news, and supporting structural reform in media.", "Bias": "left-center", "Credibility": "high credibility", "Factual": "high", "Name": "Fairness & Accuracy in Reporting (FAIR)", "Profile": "https://mediabiasfactcheck.com/fairness-accuracy-in-reporting-fair/", "Topics": "media criticism, media bias, press freedom, progressive media, censorship, corporate media, media conglomerates, public broadcasting, nonprofit media", "TrustFactors": "Nonprofit media criticism organization founded in 1986. It is based in New York City and was founded by Jeff Cohen and Martin A. Lee. FAIR is known for monitoring the U.S. news media for inaccuracy, bias, and censorship, and it advocates for a greater diversity of perspectives in news reporting. The organization opposes corporate ownership of media entities and calls for the break-up of media conglomerates, holding a progressive stance. FAIR's work is funded through donations and a store selling products. The organization is rated as having a left-center bias and high factual reporting by Media Bias/Fact Check, indicating it slightly favors the left politically but is generally trustworthy for information", "Website": "https://fair.org", "Wikipedia": "https://en.wikipedia.org/wiki/Fairness_and_Accuracy_in_Reporting", "X": "https://twitter.com/FAIRmediawatch", "Youtube": "n/a"}, {"About": "Environment and social justice", "Bias": "left-center", "Credibility": "high credibility", "Factual": "high", "Name": "Grist", "Profile": "https://mediabiasfactcheck.com/grist/", "Topics": "Environment, Social Justice, Climate Change, Sustainability, Green Living, Environmental News, Eco-friendly Solutions, Clean Energy, Environmental Advocacy", "TrustFactors": "Nonprofit. Reader supported. Viewpoint: working toward a planet that doesn’t burn and a future that doesn’t suck.", "Website": "https://grist.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Grist_(magazine)", "X": "https://twitter.com/grist", "Youtube": "https://www.youtube.com/@Grist"}, {"About": "Independent, nonprofit magazine analyzing movements on the American Left, bridging social movements with progressive politics, and offering in-depth investigations and discussions on democracy, economic justice, and policy-making.", "Bias": "left", "Credibility": "medium credibility", "Factual": "mostly", "Name": "In These Times", "Profile": "https://mediabiasfactcheck.com/in-these-times/", "Topics": "Progressive Politics, Social Justice, Labor Issues, Economic Inequality, Grassroots Movements, Political Analysis, Environment, Civil Liberties, Activism, Workers' Rights", "TrustFactors": "Reader-supported, Independent nonprofit news organization, Retains full authority over editorial content, Maintains firewall between news coverage decisions and revenue sources, Accepts gifts, grants, and sponsorships for general support, Ensures editorial control over the coverage, Commits to donor transparency", "Website": "https://inthesetimes.com", "Wikipedia": "https://en.wikipedia.org/wiki/In_These_Times", "X": "https://twitter.com/InTheseTimesMag", "Youtube": "n/a"}, {"About": "The Indigenous world, including American Indians and Alaska Natives", "Bias": null, "Credibility": null, "Factual": null, "Name": "Indian Country Today", "Profile": null, "Topics": "Indigenous News, American Indians, Alaska Natives, Native Culture, Tribal Sovereignty, Environmental Issues in Native Communities, Indigenous Rights, Native American History, Tribal News", "TrustFactors": "Not-for-profit limited liability company. Funded by donations, grants, and advertising.", "Website": "https://indiancountrytoday.com/", "Wikipedia": "https://en.wikipedia.org/wiki/Indian_Country_Today", "X": "https://twitter.com/IndianCountry", "Youtube": "https://www.youtube.com/@IndianCountryToday"}, {"About": "Climate change, energy, environment", "Bias": null, "Credibility": null, "Factual": null, "Name": "Inside Climate News", "Profile": null, "Topics": "Climate Change, Environmental Journalism, Energy Policy, Global Warming, Clean Energy Transition, Climate Science, Environmental Impact, Green Technology, Climate Advocacy", "TrustFactors": "501(c)(3) nonprofit organization. Funded by donations, grants, and corporate sponsorships. Viewpoint: serving as watchdogs of government, industry and advocacy groups and holding them accountable for their policies and actions.", "Website": "https://insideclimatenews.org/", "Wikipedia": "https://en.wikipedia.org/wiki/InsideClimate_News", "X": "https://twitter.com/insideclimate", "Youtube": "https://www.youtube.com/@InsideClimateNews"}, {"About": "Progressive multi-issue think tank dedicated to equitable, sustainable, and peaceful societal development, partnering with social movements and influencing policy and research in social justice.", "Bias": "left", "Credibility": "medium credibility", "Factual": "mostly", "Name": "Institute for Policy Studies", "Profile": "https://mediabiasfactcheck.com/institute-policy-studies/", "Topics": "Economic Justice, Racial & Gender Justice, Climate Justice, Peace & Foreign Policy", "TrustFactors": "Progressive multi-issue think tank, Independent from governmental funding and corporate influence, Engages in policy research, advocacy, and grassroots activism, Works on local, national, and global levels, Organizes interdisciplinary programs and initiatives, Pioneers in modern politics of ideas, Actively involved in anti-Vietnam War movement, Supports movements against U.S. intervention in Central America, Focuses on economic and racial justice, environmental issues, and peace & foreign policy", "Website": "https://ips-dc.org", "Wikipedia": "https://en.wikipedia.org/wiki/Institute_for_Policy_Studies", "X": "https://twitter.com/IPS_DC", "Youtube": "https://www.youtube.com/user/InstPolicyStudies"}, {"About": "World news", "Bias": null, "Credibility": null, "Factual": null, "Name": "Inter Press Service", "Profile": null, "Topics": "Development & Aid, Economy & Trade, Environment, Human Rights, Global Governance, Gender", "TrustFactors": "Not-for-profit cooperative.", "Website": "http://www.ipsnews.net/", "Wikipedia": "https://en.wikipedia.org/wiki/Inter_Press_Service", "X": "https://twitter.com/ipsnews", "Youtube": "https://www.youtube.com/@ipsnews"}, {"About": "Katie Halper is an active youtuber and dedicates most of her time to the Israel Palestine conflict.", "Bias": null, "Credibility": null, "Factual": null, "Name": "Katie Halper", "Profile": null, "Topics": "Israel Palestine conflict, progressive politics, political commentary, comedy, feminism, social justice, activism, podcasting, interviews, media criticism, left-wing perspective, Bernie Sanders, healthcare, climate change, income inequality, LGBTQ+ rights, racial justice, feminism, progressive policies.", "TrustFactors": "individual", "Website": "https://katiehalper.com", "Wikipedia": "https://en.wikipedia.org/wiki/Katie_Halper", "X": "https://twitter.com/kthalps", "Youtube": "https://www.youtube.com/@TheKatieHalperShow"}, {"About": "US labor news", "Bias": null, "Credibility": null, "Factual": null, "Name": "Labor Notes", "Profile": null, "Topics": "Organizing strategies, Aggressive approaches to fight concessions, Alliances with worker centers, Member-driven unionism", "TrustFactors": "Nonprofit. Reader supported.", "Website": "https://labornotes.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Labor_Notes", "X": "https://twitter.com/labornotes", "Youtube": "https://www.youtube.com/@labornotes"}, {"About": "US labor news", "Bias": null, "Credibility": null, "Factual": null, "Name": "LabourStart", "Profile": null, "Topics": "International trade union movement, Labor news and campaigns", "TrustFactors": "Operated by a network of volunteers. Administered by Eric Lee. Funded by donations and advertising.", "Website": "https://www.labourstart.org", "Wikipedia": "https://en.wikipedia.org/wiki/LabourStart", "X": "https://twitter.com/labourstart", "Youtube": "https://www.youtube.com/@erictlee1"}, {"About": "Latino issues", "Bias": null, "Credibility": null, "Factual": null, "Name": "Latino USA", "Profile": null, "Topics": "Latino-focused news and cultural content", "TrustFactors": "Produced by Futuro Media, a nonprofit organization. Funded by donations, grants, and corporate sponsorships.", "Website": "https://www.latinousa.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Latino_USA", "X": "https://twitter.com/LatinoUSA", "Youtube": "https://www.youtube.com/@LatinoUSA"}, {"About": "Hosts a weekly environmental news and information program distributed by PRX. It features news, interviews, and commentary on a broad range of ecological issues. The program is associated with the School for the Environment at the University of Massachusetts/Boston.", "Bias": null, "Credibility": null, "Factual": null, "Name": "Living on Earth", "Profile": null, "Topics": "Environmental News, Climate Change, Electric Vehicles, Fossil Fuel Industry, Public Health, Wildlife Conservation", "TrustFactors": "501(c)(3) nonprofit organization", "Website": "https://loe.org", "Wikipedia": "https://en.wikipedia.org/wiki/Living_on_Earth", "X": "https://twitter.com/loe_org", "Youtube": "n/a"}, {"About": "Mother Jones is a reader-supported nonprofit news organization and the winner of the American Society of Magazine Editors’ 2017 Magazine of the Year Award. Our staff does independent and investigative reporting on everything from politics and climate change to education and food.", "Bias": "left-center", "Credibility": "high credibility", "Factual": "high", "Name": "Mother Jones", "Profile": "https://mediabiasfactcheck.com/mother-jones/", "Topics": "Climate Change, Environmental Sustainability, Social Justice, Voting Rights, Gender Justice, Racial Justice", "TrustFactors": "Mother Jones is a nonprofit founded in 1976, primarily supported by reader contributions, focusing on deep investigative journalism on underreported issues, and emphasizing public service rather than corporate interests or advertising revenue", "Website": "http://www.motherjones.com/", "Wikipedia": "https://en.wikipedia.org/wiki/Mother_Jones_(magazine)", "X": "https://twitter.com/motherjones", "Youtube": "https://www.youtube.com/@MotherJones"}, {"About": "U.S. urban affairs. Inspiring greater economic, environmental, and social justice in cities.", "Bias": null, "Credibility": null, "Factual": null, "Name": "Next City", "Profile": null, "Topics": "Economic Justice, Housing, Transportation, Arts & Culture, Environment, Technology, Gentrification, Poverty, Infrastructure, Police, Community Engagement, COVID-19", "TrustFactors": "Nonprofit. Funded by foundations, individuals, corporate sponsorship, ads, and events.", "Website": "https://nextcity.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Next_City", "X": "https://twitter.com/NextCityOrg", "Youtube": "https://www.youtube.com/@NextCityOrg"}, {"About": "Norman Finkelstein is an American political scientist, activist, professor, and author, known for his primary fields of research in the Israeli-Palestinian conflict and the politics of the Holocaust. He is a critic of Israeli policies and U.S. foreign policy in the Middle East. Finkelstein's most notable works include \"The Holocaust Industry\" and \"Image and Reality of the Israel-Palestine Conflict.\" His views have been both widely supported and heavily criticized, leading to significant debate and controversy in academic and political circles.", "Bias": null, "Credibility": null, "Factual": null, "Name": "Norman Finkelstein", "Profile": null, "Topics": "Israel Palestine conflict, cancel culture, academic freedom", "TrustFactors": "individual", "Website": "https://normanfinkelstein.com", "Wikipedia": "https://en.wikipedia.org/wiki/Norman_Finkelstein", "X": "https://twitter.com/normfinkelstein", "Youtube": "https://www.youtube.com/@normanfinkelstein-kx5qm"}, {"About": "Novara Media is an independent, left-wing alternative media organization based in the United Kingdom. It was founded in 2011 by James Butler and Aaron Bastani. Novara Media focuses on addressing various issues of the 21st century, including matters such as a crisis of capitalism, racism, climate change, and more. It is committed to providing independent and truthful journalism as an alternative to mainstream media. Focuses a lot on the Israel Palestine conflict.", "Bias": "left", "Credibility": "medium credibility", "Factual": "mixed", "Name": "Novara Media", "Profile": "https://mediabiasfactcheck.com/novara-media-bias/", "Topics": "Israel Palestine conflict, UK news, social justice, politics, activism, media criticism, left-wing perspective, inequality, climate change, capitalism, feminism, anti-racism, progressive movements", "TrustFactors": "501(c)(3) nonprofit. Audience supported. No ads, underwriting, corporate or government funding.", "Website": "https://novaramedia.com", "Wikipedia": "https://en.wikipedia.org/wiki/Novara_Media", "X": "https://twitter.com/novaramedia", "Youtube": "https://www.youtube.com/@NovaraMedia"}, {"About": "Facts checked by the staff of National Public Radio", "Bias": null, "Credibility": null, "Factual": null, "Name": "NPR - Politics: Fact Check", "Profile": null, "Topics": "U.S. Politics, Political Fact-Checking, Elections, Policy Analysis, Government Accountability", "TrustFactors": "Founded in 1970 as a nonprofit. Its funding comes primarily from member stations, corporate sponsorships, institutional grants, individual contributions, and fees paid by the Public Radio Satellite System users​", "Website": "https://www.npr.org/sections/politics-fact-check", "Wikipedia": "https://en.wikipedia.org/wiki/NPR", "X": "https://twitter.com/NPR", "Youtube": "https://www.youtube.com/@NPR"}, {"About": "openDemocracy is an independent global media platform publishing up to 60 articles a week and attracting over 8 million visits per year. Through reporting and analysis of social and political issues, openDemocracy seeks to challenge power and encourage democratic debate across the world. With human rights as our central guiding focus, we ask tough questions about freedom, justice and democracy.", "Bias": null, "Credibility": null, "Factual": null, "Name": "Open Democracy", "Profile": null, "Topics": "Campaign Finance, U.S. Politics, Lobbying, Political Donations, Nonpartisan Analysis", "TrustFactors": "Nonprofit organization, located in Washington D.C., focused on tracking and publishing data on campaign finance and lobbying. Originally formed from the merger of the Center for Responsive Politics and the National Institute on Money in Politics. Funded through donations, including major donors like the Carnegie Corporation of New York, Democracy Fund, and Google.", "Website": "https://www.opendemocracy.net/", "Wikipedia": "https://en.wikipedia.org/wiki/OpenDemocracy", "X": "https://twitter.com/_openDemocracy", "Youtube": "https://www.youtube.com/@_openDemocracy"}, {"About": "Money in politics, U.S. politics and economics", "Bias": "center", "Credibility": "high credibility", "Factual": "very high", "Name": "Center for Responsive Politics (Open Secrets)", "Profile": "https://mediabiasfactcheck.com/center-for-responsive-politics-open-secrets/", "Topics": "Campaign finance, U.S. politics, money in elections, political donations, lobbying, soft money contributions, politicians' finances, political organizations, political funding trends, interest groups, non-partisan research, political finance.", "TrustFactors": "Published by the Center for Responsive Politics, a 501(c)(3) nonprofit organization. Funded by donations, grants, and income earned from custom research and licensing data for commercial use. Viewpoint: strengthening democracy by providing information about money’s role in politics.", "Website": "https://www.opensecrets.org/", "Wikipedia": "https://en.wikipedia.org/wiki/OpenSecrets", "X": "https://twitter.com/OpenSecretsDC", "Youtube": "https://www.youtube.com/@OpenSecretsDC"}, {"About": "US and world news and commentary", "Bias": null, "Credibility": null, "Factual": null, "Name": "Opt Out", "Profile": null, "Topics": "Independent Media, Digital News, Alternative Media, Current Events", "TrustFactors": "Digital news ecosystem, independent and reliable, alternative to corporate and legacy media. First news aggregation app for exclusively independent media. Project of the OptOut Media Foundation, a 501(c)(3) nonprofit charity. Funded entirely by individual donations and foundation grants, no ads.", "Website": "https://www.optoutnews.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Opt_Out_(news_aggregator)", "X": "https://twitter.com/OptOutNews", "Youtube": "https://www.youtube.com/@OptOutPodcast"}, {"About": "Research and data to address global problems", "Bias": "left-center", "Credibility": "high credibility", "Factual": "high", "Name": "Our World in Data", "Profile": "https://mediabiasfactcheck.com/our-world-in-data/", "Topics": "Poverty, Disease, Hunger, Climate Change, War, Existential Risks, Inequality, Health, Education, Violence, Political Power, Human Rights, Poverty, Inequality, Energy, Hunger, Environmental Impact", "TrustFactors": "Nonprofit organization. Funded by donations and grants.", "Website": "https://ourworldindata.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Our_World_in_Data", "X": "https://twitter.com/OurWorldInData", "Youtube": "https://www.youtube.com/@ourworldindata3652"}, {"About": "Owen Jones is a well-known British journalist and political commentator who has gained prominence for his investigative reporting on the Israel-Palestine conflict. He has contributed to publications such as 'The Guardian,' 'New Statesman,' and 'Tribune.' Jones is recognized for his influential books and his role as a left-wing activist, making a significant impact on British media and politics.", "Bias": null, "Credibility": null, "Factual": null, "Name": "Owen Jones", "Profile": null, "Topics": "Israel Palestine conflict, UK news, socialism, politics, journalism, inequality, activism, Corbynism, Labour Party, class struggle, progressive, left-wing, working class, media critique, British politics, economic justice, social justice", "TrustFactors": "individual", "Website": "https://www.theguardian.com/profile/owen-jones", "Wikipedia": "https://en.wikipedia.org/wiki/Owen_Jones_(writer)", "X": "https://twitter.com/OwenJones84", "Youtube": "https://www.youtube.com/@OwenJonesTalks"}, {"About": "Provides a daily stream of resistance news from across the United States and around the world. They are involved in organizing campaigns and participating in coalitions on a broad range of issues. Popular Resistance does not use advertising or underwriting to support its work, relying instead on donations​.", "Bias": "left", "Credibility": "high credibility", "Factual": "mostly", "Name": "Popular Resistance", "Profile": "https://mediabiasfactcheck.com/popular-resistance/", "Topics": "Peace, Justice, Economic Fairness, Environmental Protection", "TrustFactors": "Funded by The Alliance for Global Justice, Nonprofit, Grassroots Movement", "Website": "https://popularresistance.org", "Wikipedia": "https://en.wikipedia.org/wiki/Popular_Resistance_(organization)", "X": "https://twitter.com/PopResistance", "Youtube": "https://www.youtube.com/@PopularResistanceOrg"}, {"About": "Project Censored, free press, democratic self-government, news censorship, independent investigative journalism, media literacy, critical thinking, informed public, government participation", "Bias": "left", "Credibility": "high credibility", "Factual": "high", "Name": "Project Censored", "Profile": "https://mediabiasfactcheck.com/project-censored/", "Topics": "Media Literacy, Independent Journalism, Democracy, Underreported News, Media Ownership Concentration, News Deserts, Digital Divide, Misinformation, Disinformation, Independent Investigative Journalism, Media Censorship, Press Freedom, Critical Thinking in News Evaluation", "TrustFactors": "Project Censored is a nonprofit organization that promotes critical media literacy and independent journalism. Their mission includes educating students and the public about the importance of a free press for democratic self-government. They focus on exposing and opposing news censorship while promoting independent investigative journalism, media literacy, and critical thinking. They also provide comprehensive educational materials and engage in various multimedia content creation to support their mission​", "Website": "https://www.projectcensored.org", "Wikipedia": "https://en.wikipedia.org/wiki/Project_Censored", "X": "https://twitter.com/ProjectCensored", "Youtube": "https://www.youtube.com/@ProjectCensored"}, {"About": "ProPublica is an independent, nonprofit newsroom that produces investigative journalism in the public interest. Our work focuses exclusively on truly important stories, stories with “moral force.” We do this by producing journalism that shines a light on exploitation of the weak by the strong and on the failures of those with power to vindicate the trust placed in them. ", "Bias": "left-center", "Credibility": "high credibility", "Factual": "high", "Name": "ProPublica", "Profile": "https://mediabiasfactcheck.com/propublica/", "Topics": "Racial Justice, Health Care, Education, Criminal Justice, Civil Rights, Courts, Debt, Democracy, Environment, Health Insurance, Immigration, Labor, Mental Health, Military, Police, Politics, Pregnancy, Prison, Regulation, Sex and Gender, Technology, Trump Administration", "TrustFactors": "Nonprofit. Funded primarily by donations from individuals. Also accepts ads and sponsorship. Viewpoint: exposing abuses of power and betrayals of the public trust by government, business, and other institutions.", "Website": "https://www.propublica.org/", "Wikipedia": "https://en.wikipedia.org/wiki/ProPublica", "X": "https://twitter.com/propublica", "Youtube": "https://www.youtube.com/@ProPublica"}, {"About": "Consumer advocacy", "Bias": "left-center", "Credibility": "high credibility", "Factual": "high", "Name": "Public Citizen", "Profile": "https://mediabiasfactcheck.com/public-citizen/", "Topics": "Democracy Defense, Government Accountability, Consumer & Worker Safeguards, Health Care, Globalization & Trade, Climate & Energy, Justice & Courts", "TrustFactors": "Nonprofit. Funded by donations, grants, publications and subscriptions, and income from programs, rent, and investments. Viewpoint: defending democracy, resisting corporate power.", "Website": "https://www.citizen.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Public_Citizen", "X": "https://twitter.com/Public_Citizen", "Youtube": "https://www.youtube.com/@PublicCitizen"}, {"About": "Black news and history", "Bias": null, "Credibility": null, "Factual": null, "Name": "PushBlack", "Profile": null, "Topics": "Black History, Black News, Criminal Justice Reform, Voting Campaigns, Economic Justice Policy, Community Empowerment", "TrustFactors": "Nonprofit. Funded by subscriptions, donations, and grants. Viewpoint: news and history most relevant to Black people worldwide.", "Website": "https://www.pushblack.us/", "Wikipedia": "n/a", "X": "https://twitter.com/PushBlackNow", "Youtube": "https://www.youtube.com/@PushBlack"}, {"About": "Journalism about new discoveries in science and math", "Bias": "pro-science", "Credibility": "high credibility", "Factual": "very high", "Name": "Quanta Magazine", "Profile": "https://mediabiasfactcheck.com/quanta-magazine/", "Topics": "Mathematics, Theoretical Physics, Theoretical Computer Science, Basic Life Sciences", "TrustFactors": "Owned and funded by the Simons Foundation, a private foundation that funds math and science research. Editorially independent.", "Website": "https://www.quantamagazine.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Quanta_Magazine", "X": "https://twitter.com/QuantaMagazine", "Youtube": "https://www.youtube.com/@QuantaScienceChannel"}, {"About": "Secular reporting on religion", "Bias": null, "Credibility": null, "Factual": null, "Name": "Religion News Service", "Profile": null, "Topics": "Nonprofit", "TrustFactors": "Nonprofit. Affiliated with the Missouri School of Journalism at the University of Missouri. Viewpoint: progressive.", "Website": "https://religionnews.com/", "Wikipedia": "https://en.wikipedia.org/wiki/Religion_News_Service", "X": "https://twitter.com/RNS", "Youtube": "n/a"}, {"About": "US political news", "Bias": null, "Credibility": null, "Factual": null, "Name": "Reporting by Matt Taibbi", "Profile": null, "Topics": "", "TrustFactors": "Owned by journalist Matt Taibbi. For-profit. Funded by subscriptions.", "Website": "https://taibbi.substack.com/", "Wikipedia": "https://en.wikipedia.org/wiki/Matt_Taibbi", "X": "https://twitter.com/mtaibbi", "Youtube": "https://www.youtube.com/@matttaibbibehindthenews2633"}, {"About": "Supports building community resilience in a world of multiple emerging challenges: decline of cheap energy, depletion of critical resources, environmental crises, and related social and economic issues. Covers news, research, and analysis in areas such as energy, economy, environment, food & water, society, geopolitics, ecology, population, finance, urban design, health, and religious and gender issues.", "Bias": "left", "Credibility": "no credibility rating available", "Factual": "mixed", "Name": "Resilience (Post Carbon Institute)", "Profile": "https://mediabiasfactcheck.com/resilience-post-carbon-institute/", "Topics": "Supports community resilience; focuses on environmental, economic, and social challenges.", "TrustFactors": "Strong infrastructure, diverse governance structure, thriving workplace culture, and strategic plan for service delivery. Demonstrates resilience through adaptability and response to crisis, similar to bamboo scaffolding.", "Website": "https://www.resilience.org", "Wikipedia": "https://en.wikipedia.org/wiki/Resilience_(organisation)", "X": "https://twitter.com/resilience_me", "Youtube": "n/a"}, {"About": "US news, investigative reporting. Viewpoint: to shine a bright light on injustice and protect the most vulnerable.", "Bias": "left-center", "Credibility": "no credibility rating available", "Factual": "high", "Name": "Reveal – Center for Investigative Reporting", "Profile": "https://mediabiasfactcheck.com/reveal-center-for-investigative-reporting/", "Topics": "Covers a range of investigative journalism topics including criminal justice, equity, inequality, justice, gun violence, immigration, and voting access & rights. Engages in data-driven reporting, including explanatory and investigative reporting, newsroom collaborations, podcasts, and storytelling. Focuses on engaging and empowering the public through journalism that sparks action, improves lives, and protects democracy.", "TrustFactors": "Published by the Center for Investigative Reporting, a nonprofit organization. Funded by individuals and grants. No government funding.", "Website": "https://www.revealnews.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Reveal_(radio_program)", "X": "https://twitter.com/Reveal", "Youtube": "https://www.youtube.com/@reveal"}, {"About": "Reporting on lobbying and money in politics", "Bias": "left", "Credibility": "high credibility", "Factual": "high", "Name": "Sludge", "Profile": "https://mediabiasfactcheck.com/sludge/", "Topics": "Investigative journalism on lobbying and money in politics, special interests, corporate networks in government, economic powers shaping public policy", "TrustFactors": "Funded by donations and grants. No money from advertisers, interest groups, or corporations. Viewpoint: committed to exposing special interest lobbying.", "Website": "https://readsludge.com/", "Wikipedia": "n/a", "X": "https://twitter.com/Sludge", "Youtube": "n/a"}, {"About": "The intersection of gender, politics and policy", "Bias": "left", "Credibility": "high credibility", "Factual": "high", "Name": "The 19th News", "Profile": "https://mediabiasfactcheck.com/the-19th-news/", "Topics": "Gender, politics, policy, business and economy, coronavirus, education, environment and climate, health, immigration, justice, LGTBQ+ issues, race", "TrustFactors": "Nonprofit. Funded by donations and grants. Viewpoint: empowering women.", "Website": "https://www.19thnews.org/", "Wikipedia": "https://en.wikipedia.org/wiki/The_19th_(news_website)", "X": "https://twitter.com/19thnews", "Youtube": "https://www.youtube.com/@19thNews"}, {"About": "Impact of the political and legal system on the most vulnerable", "Bias": null, "Credibility": null, "Factual": null, "Name": "The Appeal", "Profile": null, "Topics": "Exposing failures and harms of the U.S. criminal legal system, systemic racism in justice, police accountability, prison abolition, alternatives to incarceration, criminal justice reform, death penalty, pretrial and prosecution practices, solitary confinement issues", "TrustFactors": "Nonprofit. Published by The Justice Collaborative, which is a fiscally sponsored project of Tides Advocacy. Funded by donations. Viewpoint: social justice.", "Website": "https://theappeal.org/", "Wikipedia": "https://en.wikipedia.org/wiki/The_Appeal_(website)", "X": "https://twitter.com/theappeal", "Youtube": "n/a"}, {"About": "The Center for Public Integrity was founded in 1989 by Charles Lewis. We are one of the country's oldest and largest nonpartisan, nonprofit investigative news organizations. We are also the winner of the 2014 Pulitzer Prize for investigative reporting and the 2017 Pulitzer Prize for explanatory reporting.", "Bias": null, "Credibility": null, "Factual": null, "Name": "The Center for Public Integrity", "Profile": null, "Topics": "Inequity, Threats to democracy, Trade policy and lobbying, Political fundraising and campaign finance, War profiteering, Pharmaceutical lobbying, Financial crisis, Climate change lobbying, Global cigarette smuggling, Sexual assault on campuses, Chemical industry influence, Offshore banking and global corruption", "TrustFactors": "501(c)(3) nonprofit organization. Funded by donations and grants", "Website": "https://publicintegrity.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Center_for_Public_Integrity", "X": "https://twitter.com/publici", "Youtube": "https://www.youtube.com/@PublicintegrityOrg"}, {"About": "Academic journalism on national and world issues", "Bias": "center", "Credibility": "high credibility", "Factual": "very high", "Name": "The Conversation", "Profile": "https://mediabiasfactcheck.com/the-conversation/", "Topics": "In-depth analysis and commentary on a variety of topics including politics, science, health, education, environment, technology, and culture", "TrustFactors": "Independent and not-for-profit. Funded by universities and foundations.", "Website": "https://theconversation.com/us", "Wikipedia": "https://en.wikipedia.org/wiki/The_Conversation_(website)", "X": "https://twitter.com/ConversationUS", "Youtube": "https://www.youtube.com/@TheConversation"}, {"About": "The Daily Beast is an American news website focused on politics, media, and pop culture. Founded in 2008, headquartered in New York City.", "Bias": "left", "Credibility": " credibility", "Factual": "mixed", "Name": "Daily Beast", "Profile": "https://mediabiasfactcheck.com/daily-beast/", "Topics": "Politics, Media, Pop culture, Scandals, Confronting bullies and hypocrites, Bipartisan political coverage, White House and Trump Administration", "TrustFactors": "Parent company is IAC (InterActiveCorp), led by Barry Diller. For-profit organization.", "Website": "http://www.thedailybeast.com/", "Wikipedia": "https://en.wikipedia.org/wiki/The_Daily_Beast", "X": "https://twitter.com/thedailybeast", "Youtube": "https://www.youtube.com/@TheDailyBeast"}, {"About": "US political news", "Bias": null, "Credibility": null, "Factual": null, "Name": "The Daily Poster", "Profile": null, "Topics": "In-depth analysis and commentary on politics, economic policy, corporate power, labor issues, and media criticism", "TrustFactors": "For-profit newsletter and website featuring political news and commentary by investigative reporter David Sirota. Funded by subscriptions.", "Website": "https://sirota.substack.com/", "Wikipedia": "https://en.wikipedia.org/wiki/David_Sirota", "X": "https://twitter.com/davidsirota", "Youtube": "n/a"}, {"About": "US and world news by emerging journalists", "Bias": null, "Credibility": null, "Factual": null, "Name": "The GroundTruth Project", "Profile": null, "Topics": "Social justice and human rights issues, in-depth special reports, media industry, misinformation, global challenges, race-focused stories, public health, environment, religion, humanitarian crises", "TrustFactors": "Nonprofit. Funded by donations and grants.", "Website": "https://thegroundtruthproject.org/", "Wikipedia": "n/a", "X": "https://twitter.com/groundtruth", "Youtube": "https://www.youtube.com/@GroundTruthProject"}, {"About": "The Guardian - US Version is a division of the Guardian, headquartered in the United Kingdom.", "Bias": "left-center", "Credibility": "medium credibility", "Factual": "mixed", "Name": "The Guardian", "Profile": "https://mediabiasfactcheck.com/the-guardian/", "Topics": "US and world news", "TrustFactors": "Owned by a private company that cannot pay dividends. Funded by an endowment, by foundations, and by readers. Viewpoint: center-left.", "Website": "https://www.theguardian.com/", "Wikipedia": "https://en.wikipedia.org/wiki/The_Guardian", "X": "https://twitter.com/guardian", "Youtube": "https://www.youtube.com/@guardiannews"}, {"About": "The Indypendent is a free, progressive newspaper and online news site, focusing on social justice movements in New York and beyond.", "Bias": "left", "Credibility": "high credibility", "Factual": "high", "Name": "The Indypendent", "Profile": "https://mediabiasfactcheck.com/the-indypendent/", "Topics": "Progressive news covering social justice movements, local and international news, public health, environmental issues, labor movements, political analysis", "TrustFactors": "Reader-supported news, funded through donations and advertising. Nonprofit organization.", "Website": "https://indypendent.org", "Wikipedia": "https://en.wikipedia.org/wiki/The_Indypendent", "X": "https://twitter.com/indypendent", "Youtube": "https://www.youtube.com/@theindypendent6946"}, {"About": "We believe the prime value of journalism is that it imposes transparency, and thus accountability, on those who wield the greatest governmental and corporate power. Our journalists will be not only permitted, but encouraged, to pursue stories without regard to whom they might alienate.", "Bias": "left-center", "Credibility": "high credibility", "Factual": "mostly", "Name": "The Intercept", "Profile": "https://mediabiasfactcheck.com/the-intercept/", "Topics": "Surveillance, Whistleblowers, Government transparency, Civil liberties, National security, Criminal justice reform, Climate change, Corporate power, Privacy issues, Social justice, Technology and its impact on society, Immigration, Political corruption, Investigative journalism, International affairs", "TrustFactors": "Funded by eBay founder Pierre Omidyar’s media company, First Look Media. Funding structure unclear.", "Website": "https://theintercept.com/", "Wikipedia": "https://en.wikipedia.org/wiki/The_Intercept", "X": "https://twitter.com/theintercept", "Youtube": "https://www.youtube.com/@TheInterceptFLM"}, {"About": "U.S. criminal justice system", "Bias": "center", "Credibility": "high credibility", "Factual": "high", "Name": "The Marshall Project", "Profile": "https://mediabiasfactcheck.com/the-marshall-project/", "Topics": "Criminal justice reform, Incarceration, Prison system, Policing, Criminal justice policy, Mass incarceration, Sentencing, Juvenile justice, Death penalty, Criminal justice data, Criminal justice disparities, Legal system, Prison conditions, Criminal justice reporting, Racial disparities in the criminal justice system", "TrustFactors": "501(c)(3) nonprofit. Funding: foundations and individuals. Viewpoint: to create and sustain a sense of national urgency about the U.S. criminal justice system. Committed to a diverse workforce.", "Website": "https://www.themarshallproject.org/", "Wikipedia": "https://en.wikipedia.org/wiki/The_Marshall_Project", "X": "https://twitter.com/MarshallProj", "Youtube": "https://www.youtube.com/@TheMarshallProject"}, {"About": "Platform for voices of dissent and those under-represented in mainstream media. It champions grassroots progressive politics, with a focus on peace, social justice, and the common good.", "Bias": "left", "Credibility": "high credibility", "Factual": "mostly", "Name": "The Progressive", "Profile": "https://mediabiasfactcheck.com/the-progressive/", "Topics": "Resistance, Democracy, Climate, COVID-19, Disability Rights, Foreign Policy, Gender Justice, Health Care, Housing, Labor, LGBTQ+, Racial Justice, War and Peace, Magazine, Public Schools Advocate, About Public Schools Advocate, Donor Transparency", "TrustFactors": "Reader-supported nonprofit since 1909", "Website": "https://progressive.org", "Wikipedia": "https://en.wikipedia.org/wiki/The_Progressive", "X": "https://twitter.com/thenation", "Youtube": "https://www.youtube.com/theprogressive"}, {"About": "The Real News Network is a platform that focuses on principled journalism that delves into the root causes of various crises. They prioritize journalism that empowers people to take action and address issues such as worker exploitation, the climate crisis, white supremacy, and more. They produce shows, podcasts, and series that provide in-depth analysis and reporting on these issues.", "Bias": "left", "Credibility": "high credibility", "Factual": "high", "Name": "Real News Network", "Profile": "https://mediabiasfactcheck.com/real-news-network/", "Topics": "US news, international news, justice, equality, ecology, climate crisis, economy and inequality, movements and politics (both international and in the US), prisons and policing, racial justice", "TrustFactors": "501(c)(3) nonprofit organization. Funded by donations and grants. No ads, no corporate or government funding. It relies on donations from its community.", "Website": "https://therealnews.com/", "Wikipedia": "https://en.wikipedia.org/wiki/The_Real_News_Network", "X": "https://twitter.com/TheRealNews", "Youtube": "https://www.youtube.com/@TheRealNews"}, {"About": "Gun violence in the U.S.", "Bias": "left-center", "Credibility": "high credibility", "Factual": "high", "Name": "The Trace", "Profile": "https://mediabiasfactcheck.com/the-trace/", "Topics": "gun violence crisis, gun accountability, firearm related crimes, deaths, injuries", "TrustFactors": "Nonprofit. Funded by grants and donations.", "Website": "https://www.thetrace.org/", "Wikipedia": "https://en.wikipedia.org/wiki/The_Trace_(website)", "X": "https://twitter.com/teamtrace", "Youtube": "n/a"}, {"About": "US and world news", "Bias": "left-center", "Credibility": "high credibility", "Factual": "very high", "Name": "The World from PRX", "Profile": "https://mediabiasfactcheck.com/public-radio-international-pri/", "Topics": "Social Justice Issues, Global Issues and Women's Rights, Immigration and Diversity", "TrustFactors": "Public Radio International (PRI) has merged with Public Radio Exchange (PRX). The World is a co-production of PRX, WGBH and the BBC World Service. PRX is a 501(c)(3) nonprofit organization funded by donations and grants. WGBH is a public radio station funded by donations, grants, and corporate sponsorships. BBC World Service is funded by the British government.", "Website": "https://www.pri.org/", "Wikipedia": "https://en.wikipedia.org/wiki/The_World_(radio_program)", "X": "https://twitter.com/pritheworld", "Youtube": "n/a"}, {"About": "TruthBeTold.news (formerly called HU Insight) is a nonprofit, non-partisan website and digital network, run and edited from Howard University’s Department of Media, Journalism and Film in the School of Communications. It uses journalistic skills and crowdsourced information to play a leading role by examining claims about the black community in public debate .", "Bias": "left-center", "Credibility": "high credibility", "Factual": "high", "Name": "Truth Be Told", "Profile": "https://mediabiasfactcheck.com/truth-be-told/", "Topics": "Black Lives Matter and Social Justice, Education, Fact-Checks and Myths, Music and Culture, Politics and Government, Economics and Racial Wealth Gap", "TrustFactors": "Funded through grants and donations, project of Howard University. Nonprofit organization.", "Website": "http://truthbetold.news/category/fact-checks/", "Wikipedia": "https://en.wikipedia.org/wiki/TruthBeTold.news", "X": "https://twitter.com/truthbetoldnews", "Youtube": "n/a"}, {"About": "Truthdig, founded in 2005 by Publisher Zuade Kaufman and Editor in Chief Robert Scheer, is dedicated to reporting on current issues that are insufficiently covered by mainstream media. The website’s mission is to dig beneath the headlines, provide expert reporting and commentary from a progressive point of view, and offer an outlet for original work by exceptional journalists.", "Bias": "left", "Credibility": "high credibility", "Factual": "high", "Name": "TruthDig", "Profile": "https://mediabiasfactcheck.com/truthdig/", "Topics": "Arts Criticism, Activism, Politics, Environment, Education, Diversity, Science, Technology, World Regions", "TrustFactors": "Held through Truthdig LLC, generates revenue through advertising, donations, and grants. For-profit organization.", "Website": "http://www.truthdig.com/", "Wikipedia": "https://en.wikipedia.org/wiki/Truthdig", "X": "https://twitter.com/truthdig", "Youtube": "https://www.youtube.com/@truthdig"}, {"About": "Truthout works to spark action by revealing systemic injustice and providing a platform for transformative ideas, through in-depth investigative reporting and critical analysis. With a powerful, independent voice, we will spur the revolution in consciousness and inspire the direct action that is necessary to save the planet and humanity.", "Bias": "left", "Credibility": "medium credibility", "Factual": "mixed", "Name": "TruthOut", "Profile": "https://mediabiasfactcheck.com/truth-out/", "Topics": "Social Justice, Investigative Journalism, Political Analysis, Environmental Issues, Corporate Influence, Human Rights, U.S. Politics, Progressive Perspectives", "TrustFactors": "Nonprofit. Funded primarily by donations from readers. Some foundation grants. No ads or corporate funding.", "Website": "http://www.truth-out.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Truthout", "X": "https://twitter.com/truthout", "Youtube": "https://www.youtube.com/@truthout"}, {"About": "Investigative reporting", "Bias": null, "Credibility": null, "Factual": null, "Name": "Type Investigations", "Profile": null, "Topics": "", "TrustFactors": "501(c)(3) nonprofit organization, formerly the Investigative Fund of the Nation Institute, which was affiliated with the Nation magazine. Funded by donations and grants.", "Website": "https://typeinvestigations.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Type_Investigations", "X": "https://twitter.com/typeinvestigate", "Youtube": "n/a"}, {"About": "US news", "Bias": "left", "Credibility": "high credibility", "Factual": "high", "Name": "Unicorn Riot", "Profile": "https://mediabiasfactcheck.com/unicorn-riot/", "Topics": "decentralized media, educational, non-profit, independent journalism, underrepresented stories, alternative perspectives, diverse stories, community engagement, non-hierarchical, free nonprofit news", "TrustFactors": "501(c)(3) nonprofit organization. Funded by donations. Independent of corporate or government control. Viewpoint: exposing root causes of dynamic social and environmental issues", "Website": "https://unicornriot.ninja/", "Wikipedia": "https://en.wikipedia.org/wiki/Unicorn_Riot", "X": "https://twitter.com/UR_Ninja", "Youtube": "https://www.youtube.com/@UnicornRiot"}, {"About": "WhoWhatWhy embodies a form of investigative reporting that is rigorous, relentless and scientific — we call it forensic journalism.", "Bias": "left", "Credibility": "medium credibility", "Factual": "mixed", "Name": "Who.What.Why", "Profile": "https://mediabiasfactcheck.com/who-what-why/", "Topics": "Investigative Journalism, Politics, Elections, International Affairs, Justice, Hidden Power, Economy, Science, Technology, Culture, Opinions, Analysis, Multimedia Content, Election Integrity, Environmental Journalism, Mentor-Apprentice Program", "TrustFactors": "Nonprofit. Readers supported.", "Website": "https://whowhatwhy.org/", "Wikipedia": "https://en.wikipedia.org/wiki/WhoWhatWhy", "X": "https://twitter.com/whowhatwhy", "Youtube": "https://www.youtube.com/@WhoWhatWhy"}, {"About": "Environmental news", "Bias": null, "Credibility": null, "Factual": null, "Name": "Yale Environment 360", "Profile": null, "Topics": "biodiversity, climate change, energy, food and agriculture, oceans, policy, cities, solutions to environmental challenges", "TrustFactors": "Published by the Yale School of Forestry and Environmental Studies. Yale is a private research university. Funded by grants.", "Website": "https://e360.yale.edu/", "Wikipedia": "https://en.wikipedia.org/wiki/Yale_Environment_360", "X": "https://twitter.com/YaleE360", "Youtube": "n/a"}, {"About": "Yes! Magazine reframes the biggest problems of our time in terms of their solutions. Online and in print, we outline a path forward with in-depth analysis, tools for citizen engagement, and stories about real people working for a better world.", "Bias": "left", "Credibility": "high credibility", "Factual": "high", "Name": "Yes Magazine", "Profile": "https://mediabiasfactcheck.com/yes-magazine/", "Topics": "Independent Publisher, Solutions Journalism, Social Justice, Environmental Sustainability, Alternative Economics, Peace, Community-based Solutions, Active Engagement, Just Transition, Sanctuary City, Solidarity Economy, Decolonization, Recycled Paper Use, Progressive Journalism Network, Racial Justice, Government and Politics Reporting, Digital Innovation, Environment, Nature, Science Reporting", "TrustFactors": "Owned and published by Positive Futures Network, a 501 (c) (3) nonprofit organization, funded through donations and subscription fees. Nonprofit organization.", "Website": "http://www.yesmagazine.org/", "Wikipedia": "https://en.wikipedia.org/wiki/Yes!_(U.S._magazine)", "X": "https://twitter.com/yesmagazine", "Youtube": "n/a"}, {"About": "Dedicated to developing vision and strategic activism, resisting injustice, defending against repression, and fostering liberty, ZNetwork views the racial, gender, class, political, and ecological dimensions of life as fundamental to understanding and improving contemporary circumstances. It's a platform for educational content, vision, and strategic analysis, aimed at assisting activist efforts for a better future", "Bias": null, "Credibility": null, "Factual": null, "Name": "Z Network", "Profile": null, "Topics": "Activism, Politics/Government, International Relations, Climate Change, Labor, Memorial, Social Theory, Vision & Strategy, Law/Crime/Justice, Media, Institutional Racism, U.S. Foreign Policy, Global Economy, Economic Vision, Radical Theory, Political Economy, Anti-Capitalism, Libertarian Socialism, Participatory Economics, Alternative Media", "TrustFactors": "Owned by Z Network, a left-wing activist-oriented media group. Funded through donations. Nonprofit organization under Institute for Social and Cultural Communications, Inc.", "Website": "https://znetwork.org", "Wikipedia": "https://en.wikipedia.org/wiki/Z_Communications", "X": "https://twitter.com/zcomm", "Youtube": "https://www.youtube.com/@znetwork_official"}]